==========================
.A16
==========================

.a16

---

(ca65
  (ctrl_cmd
    (a16_ctrl_cmd)))

==========================
.A8
==========================

.a8

---

(ca65
  (ctrl_cmd
    (a8_ctrl_cmd)))

==========================
.ADDR
==========================

.addr $ffff
.addr $ffff, $ffff

---

(ca65
  (ctrl_cmd
    (addr_ctrl_cmd
      (operand_16
        (hex_16))))
  (ctrl_cmd
    (addr_ctrl_cmd
      (operand_16
        (hex_16))
      (operand_16
        (hex_16)))))

==========================
.ALIGN
==========================

.align $ff
.align $ff, $ff

---

(ca65
  (ctrl_cmd
    (align_ctrl_cmd
      (operand_8
        (hex_8))))
  (ctrl_cmd
    (align_ctrl_cmd
      (operand_8
        (hex_8))
        (operand_8
          (hex_8)))))

==========================
.ASCIIZ
==========================

.asciiz "omg"
.asciiz "omg", "omg"

---

(ca65
  (ctrl_cmd
    (asciiz_ctrl_cmd
      (string)))
  (ctrl_cmd
    (asciiz_ctrl_cmd
      (string)
      (string))))

==========================
.ASSERT
==========================

.assert 1 <> 1, warning, "omg"
.assert 1 = 1, error, "foo"
.assert 1 > 1, ldwarning, "bar"
.assert 1 < 1, lderror, "yolo"

---

(ca65
  (ctrl_cmd
    (assert_ctrl_cmd
      (expression
        (neq_cmp
          (expression
            (operand_8
              (dec_8)))
          (expression
            (operand_8
              (dec_8)))))
      (warning_keyword)
      (string)))
  (ctrl_cmd
    (assert_ctrl_cmd
      (expression
        (eq_cmp
          (expression
            (operand_8
              (dec_8)))
          (expression
            (operand_8
              (dec_8)))))
      (error_keyword)
      (string)))
  (ctrl_cmd
    (assert_ctrl_cmd
      (expression
        (gt_cmp
          (expression
            (operand_8
              (dec_8)))
          (expression
            (operand_8
              (dec_8)))))
      (ldwarning_keyword)
      (string)))
  (ctrl_cmd
    (assert_ctrl_cmd
      (expression
        (lt_cmp
          (expression
            (operand_8
              (dec_8)))
          (expression
            (operand_8
              (dec_8)))))
      (lderror_keyword)
      (string))))

==========================
.AUTOIMPORT
==========================

.autoimport +
.autoimport -

---

(ca65
  (ctrl_cmd
    (autoimport_ctrl_cmd
      (plus_symbol)))
  (ctrl_cmd
    (autoimport_ctrl_cmd
      (sub_symbol))))

==========================
.BANKBYTES
==========================

table: .bankbytes table

---

(ca65
  (label)
  (ctrl_cmd
    (bankbytes_ctrl_cmd
      (expression
        (operand_8
          (symbol))))))

==========================
.BYTE/.BYT
==========================

.byte "Hello "
.byt  "world", $0D, $00

---

(ca65
  (ctrl_cmd
    (byte_ctrl_cmd
      (expression
        (string))))
  (ctrl_cmd
    (byte_ctrl_cmd
      (expression
        (string))
      (expression
        (operand_8
          (hex_8)))
      (expression
        (operand_8
          (hex_8))))))

==========================
.CASE
==========================

.case +
.case -

---

(ca65
  (ctrl_cmd
    (case_ctrl_cmd
      (plus_symbol)))
  (ctrl_cmd
    (case_ctrl_cmd
      (sub_symbol))))

==========================
.CHARMAP
==========================

.charmap $41, $61

---

(ca65
  (ctrl_cmd
    (charmap_ctrl_cmd
      (expression
        (operand_8
          (hex_8)))
      (expression
        (operand_8
          (hex_8))))))

==========================
.CODE
==========================

.code

---

(ca65
  (ctrl_cmd
    (code_ctrl_cmd)))

==========================
.CONDES
==========================

.condes symbol, constructor
.condes symbol, destructor
.condes symbol, interruptor
.condes symbol, 3 + 3
.condes symbol, 6, 9000

---

(ca65
  (ctrl_cmd
    (condes_ctrl_cmd
      (symbol)
        (constructor_keyword)))
  (ctrl_cmd
    (condes_ctrl_cmd
      (symbol)
        (destructor_keyword)))
  (ctrl_cmd
    (condes_ctrl_cmd
      (symbol)
        (interruptor_keyword)))
  (ctrl_cmd
    (condes_ctrl_cmd
      (symbol)
        (expression
          (add_exp
            (expression
              (operand_8
                (dec_8)))
            (expression
              (operand_8
                (dec_8)))))))
  (ctrl_cmd
    (condes_ctrl_cmd
      (symbol)
        (expression
          (operand_8
            (dec_8)))
        (expression
          (operand_16
            (dec_16))))))

==========================
.CONSTRUCTOR
==========================

.constructor symbol
.constructor symbol, 16

---

(ca65
  (ctrl_cmd
    (constructor_ctrl_cmd
      (symbol)))
  (ctrl_cmd
    (constructor_ctrl_cmd
      (symbol)
        (expression
          (operand_8
            (dec_8))))))

==========================
.DATA
==========================

.data

---

(ca65
  (ctrl_cmd
    (data_ctrl_cmd)))

==========================
.DBYT
==========================

.dbyt $1234
.dbyt $1234, $4512, $ffff

---

(ca65
  (ctrl_cmd
    (dbyt_ctrl_cmd
      (expression
        (operand_16
          (hex_16)))))
  (ctrl_cmd
    (dbyt_ctrl_cmd
      (expression
        (operand_16
          (hex_16)))
      (expression
        (operand_16
          (hex_16)))
      (expression
        (operand_16
          (hex_16))))))

==========================
.DEBUGINFO
==========================

.debuginfo +
.debuginfo -

---

(ca65
  (ctrl_cmd
    (debuginfo_ctrl_cmd
      (plus_symbol)))
  (ctrl_cmd
    (debuginfo_ctrl_cmd
      (sub_symbol))))

==========================
.DEFINE
==========================

.define VERSION "12.3a"
.define COMBINE(ta, tb, tc) ta+tb*10+tc*100

---

(ca65
  (ctrl_cmd
    (define_ctrl_cmd
      (symbol)
        (expression
          (string))))
  (ctrl_cmd
    (define_ctrl_cmd
      (symbol)
      (symbol)
      (symbol)
      (symbol)
      (expression
        (add_exp
          (expression
            (add_exp
              (expression
                (operand_8
                  (symbol)))
              (expression
                (mult_exp
                  (expression
                    (operand_8
                      (symbol)))
                  (expression
                    (operand_8
                      (dec_8)))))))
          (expression
            (mult_exp
              (expression
                (operand_8
                  (symbol)))
              (expression
                (operand_8
                  (dec_8))))))))))

==========================
.DELMAC/.DELMACRO
==========================

.delmac   macro
.delmacro macro

---

(ca65
  (ctrl_cmd
    (delmac_ctrl_cmd
      (symbol)))
  (ctrl_cmd
    (delmac_ctrl_cmd
      (symbol))))

==========================
.DESTRUCTOR
==========================

.destructor symbol
.destructor symbol, 400+20

---

(ca65
  (ctrl_cmd
    (destructor_ctrl_cmd
      (symbol)))
  (ctrl_cmd
    (destructor_ctrl_cmd
      (symbol)
      (expression
        (add_exp
          (expression
            (operand_16
              (dec_16)))
          (expression
            (operand_8
              (dec_8))))))))

